{
    "uci_id": 697,
    "name": "Predict Students Dropout and Academic Success",
    "repository_url": "https: //archive.ics.uci.edu/dataset/697/predict+students+dropout+and+academic+success",
    "data_url": "https://archive.ics.uci.edu/static/public/697/data.csv",
    "abstract": "A dataset created from a higher education institution (acquired from several disjoint databases) related to students enrolled in different undergraduate degrees, such as agronomy, design, education, nursing, journalism, management, social service, and technologies.\nThe dataset includes information known at the time of student enrollment (academic path, demographics, and social-economic factors) and the students academic performance at the end of the first and second semesters. \nThe data is used to build classification models to predict students dropout and academic sucess. The problem is formulated as a three category classification task, in which there is a strong imbalance towards one of the classes.",
    "area": "Social Science",
    "tasks": [
        "Classification"
    ],
    "characteristics": [
        "Tabular"
    ],
    "num_instances": 4424,
    "num_features": 36,
    "feature_types": [
        "Real",
        "Categorical",
        "Integer"
    ],
    "demographics": [
        "Marital Status",
        "Education Level",
        "Nationality",
        "Occupation",
        "Gender",
        "Age"
    ],
    "target_col": [
        "Target"
    ],
    "index_col": null,
    "has_missing_values": "no",
    "missing_values_symbol": null,
    "year_of_dataset_creation": 2021,
    "last_updated": "Mon Feb 26 2024",
    "dataset_doi": "10.24432/C5MC89",
    "creators": [
        "Valentim Realinho",
        "Mónica Vieira Martins",
        "Jorge Machado",
        "Luís Baptista"
    ],
    "intro_paper": {
        "title": "Early prediction of students performance in higher education: a case study",
        "authors": "Mónica V. Martins, Daniel Tolledo, Jorge Machado, Luís M. T. Baptista, and Valentim Realinho",
        "published_in": "Trends and Applications in Information Systems and Technologies",
        "year": 2021,
        "url": "http://www.worldcist.org/2021/",
        "doi": "http://www.doi.org/10.1007/978-3-030-72657-7_16"
    },
    "additional_info": {
        "summary": null,
        "purpose": "The dataset was created in a project that aims to contribute to the reduction of academic dropout and failure in higher education, by using machine learning techniques to identify students at risk at an early stage of their academic path, so that strategies to support them can be put into place. \n\nThe dataset includes information known at the time of student enrollment – academic path, demographics, and social-economic factors. \n\nThe problem is formulated as a three category classification task (dropout, enrolled, and graduate) at the end of the normal duration of the course. \n",
        "funded_by": "This dataset is supported by program SATDAP - Capacitação da Administração Pública under grant POCI-05-5762-FSE-000191, Portugal.",
        "instances_represent": "Each instance is a student",
        "recommended_data_splits": "The dataset was used, in our project, with a data split of 80% for training and 20% for test.",
        "sensitive_data": null,
        "preprocessing_description": "We performed a rigorous data preprocessing to handle data from anomalies, unexplainable outliers, and missing values.",
        "variable_info": null,
        "citation": "If you use this dataset in experiments for a scientific publication, please kindly cite our paper: \nM.V.Martins, D. Tolledo, J. Machado, L. M.T. Baptista, V.Realinho. (2021) Early prediction of student’s performance in higher education: a case study Trends and Applications in Information Systems and Technologies, vol.1, in Advances in Intelligent Systems and Computing series. Springer. DOI: 10.1007/978-3-030-72657-7_16"
    }
}